#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-8e001e75-263f-4b2f-931e-f2037fcc675f-a26cff92-ab53-4342-8e68-f96dd7bbd9b4]
azuread_application.github_actions_aadapplication["azure-functions-playground"]: Refreshing state... [id=/applications/96051860-a27e-4eeb-9008-ef3227af90fd]
azuread_application.github_actions_aadapplication["tf-sandbox"]: Refreshing state... [id=/applications/5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55]
azuread_application.github_actions_aadapplication["apim-managed-test-dev"]: Refreshing state... [id=/applications/b2d7c879-b315-4ae9-bf46-46f6ce9fd882]
azuread_application.github_actions_aadapplication["telemetry-test"]: Refreshing state... [id=/applications/41b91d62-e4b4-4361-9c07-8c1e024f5690]
azuread_application.github_actions_aadapplication["tf-github-repo-management"]: Refreshing state... [id=/applications/912b61f9-737f-4c60-8dd8-c2af36fbc44b]
azuread_application.github_actions_aadapplication["backstage_test"]: Refreshing state... [id=/applications/96fd3546-c563-4995-b477-88da8c572ba5]
azuread_application_federated_identity_credential.cred["telemetry-test"]: Refreshing state... [id=41b91d62-e4b4-4361-9c07-8c1e024f5690/federatedIdentityCredential/389950b0-d4f6-41a7-92fd-56e7fa17df32]
azuread_application_federated_identity_credential.cred["azure-functions-playground"]: Refreshing state... [id=96051860-a27e-4eeb-9008-ef3227af90fd/federatedIdentityCredential/be9764f4-91f1-4a0c-8fd6-c7faf47f66f5]
azuread_application_federated_identity_credential.cred["tf-github-repo-management"]: Refreshing state... [id=912b61f9-737f-4c60-8dd8-c2af36fbc44b/federatedIdentityCredential/e920d867-cc2c-4cff-82ac-c39bba3a52b9]
azuread_application_federated_identity_credential.cred["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5/federatedIdentityCredential/780736fb-df2b-4609-80e8-eab432153ec6]
azuread_application_federated_identity_credential.cred["tf-sandbox"]: Refreshing state... [id=5e3da8bf-1ebb-4b6f-96ee-17f1eb4c5d55/federatedIdentityCredential/c85dfb45-807d-4473-a4bf-1c9901ed24aa]
azuread_application_federated_identity_credential.cred["apim-managed-test-dev"]: Refreshing state... [id=b2d7c879-b315-4ae9-bf46-46f6ce9fd882/federatedIdentityCredential/bf28ed1a-9dce-4d7b-b060-2ef4afbc37ac]
azuread_service_principal.github_actions_sp["azure-functions-playground"]: Refreshing state... [id=/servicePrincipals/5ac34ad8-49f7-4bc7-af91-ce78cf9f4590]
azuread_service_principal.github_actions_sp["tf-github-repo-management"]: Refreshing state... [id=/servicePrincipals/1b1ecaef-d090-4fa5-9fc4-5adb820e3137]
azuread_service_principal.github_actions_sp["backstage_test"]: Refreshing state... [id=/servicePrincipals/a7661791-72fe-4907-a9b2-2aa885ef3ea5]
azuread_service_principal.github_actions_sp["apim-managed-test-dev"]: Refreshing state... [id=/servicePrincipals/a112bfb0-88fb-46f5-a19b-e00ba99c51a4]
azuread_service_principal.github_actions_sp["telemetry-test"]: Refreshing state... [id=/servicePrincipals/23026963-a170-4d19-b79f-eccca0caeedd]
azuread_service_principal.github_actions_sp["tf-sandbox"]: Refreshing state... [id=/servicePrincipals/b9d819c2-e68a-4d3c-862d-692c9716e8bd]
azurerm_resource_group.instance["apim-managed-test-dev"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-apim-managed-test]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_resource_group.instance["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-key-vault-administrator"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/d476f5fe-b965-d92f-c4f2-73e3ec6c8d76]
azurerm_role_assignment.instance["apim-managed-test-dev"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-apim-managed-test/providers/Microsoft.Authorization/roleAssignments/1e010d8c-cf0b-ac86-7e40-4b54a6f3aeed]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-azure-service-bus-data-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/a37300fd-ddac-dcc3-6373-99d53b256f1e]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-table-data-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/f93adc2a-3d5f-e2e2-9cc6-9f6187b5471a]
azurerm_role_assignment.instance["telemetry-test"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/1cf427ea-8c55-8d3c-dd04-8d0d17a24b42]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-user-access-administrator"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/4a9c3354-432f-ffb0-c151-daa40999694d]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-account-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/8b3472de-97fe-9db5-0e41-c808e9da4d48]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-privileged-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/ebc555c7-dc87-b49a-38cd-3cf04e9bb428]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-elevated-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/2610632b-49d6-08c9-0350-ecd4f8be59ff]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-file-data-smb-share-contributor"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/6ea8e84f-27bd-e1c8-a253-9edeeb287f32]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/15116935-e421-e5e3-6cc2-9ce915972712]
azurerm_role_assignment.custom_rg_assignments["telemetry-test-storage-blob-data-owner"]: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-telemetry-test/providers/Microsoft.Authorization/roleAssignments/b04f660b-1d9b-7ea2-5bba-06fbe80b49d8]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]
azurerm_storage_container.ad_tf_backends["telemetry-test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/telemetry-test]
azurerm_storage_container.tf_backends_sc["infra-azure-foundations"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/infra-azure-foundations]
azurerm_storage_container.tf_backends_sc["apim-managed-test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/apim-managed-test]
azurerm_storage_container.tf_backends_sc["tf-github-repo-management"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/tf-github-repo-management]
azurerm_storage_container.tf_backends_sc["backstage_test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/backstage-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # azuread_application.github_actions_aadapplication["infra-azure-foundations-infra"] will be created
  + resource "azuread_application" "github_actions_aadapplication" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "github-actions-infra-azure-foundations-infra"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "a26cff92-ab53-4342-8e68-f96dd7bbd9b4",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application.github_actions_aadapplication["infra-azure-foundations-preview"] will be created
  + resource "azuread_application" "github_actions_aadapplication" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "github-actions-infra-azure-foundations-preview"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "a26cff92-ab53-4342-8e68-f96dd7bbd9b4",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)
    }

  # azuread_application_federated_identity_credential.cred["infra-azure-foundations-infra"] will be created
  + resource "azuread_application_federated_identity_credential" "cred" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Terraform deployments for badbort/infra-azure-foundations"
      + display_name   = "infra-azure-foundations"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:badbort/infra-azure-foundations:environment:infra"
    }

  # azuread_application_federated_identity_credential.cred["infra-azure-foundations-preview"] will be created
  + resource "azuread_application_federated_identity_credential" "cred" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + description    = "Terraform deployments for badbort/infra-azure-foundations"
      + display_name   = "infra-azure-foundations"
      + id             = (known after apply)
      + issuer         = "https://token.actions.githubusercontent.com"
      + subject        = "repo:badbort/infra-azure-foundations:environment:preview"
    }

  # azuread_service_principal.github_actions_sp["infra-azure-foundations-infra"] will be created
  + resource "azuread_service_principal" "github_actions_sp" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azuread_service_principal.github_actions_sp["infra-azure-foundations-preview"] will be created
  + resource "azuread_service_principal" "github_actions_sp" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_storage_container.tf_backends_sc["infra-azure-foundations"] will be destroyed
  # (because key ["infra-azure-foundations"] is not in for_each map)
  - resource "azurerm_storage_container" "tf_backends_sc" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "https://badbortcommontfstatesta.blob.core.windows.net/infra-azure-foundations" -> null
      - metadata                          = {
          - "repo" = "https://github.com/badbort/infra-azure-foundations"
        } -> null
      - name                              = "infra-azure-foundations" -> null
      - resource_manager_id               = "/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta/blobServices/default/containers/infra-azure-foundations" -> null
      - storage_account_name              = "badbortcommontfstatesta" -> null
    }

Plan: 6 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with azurerm_storage_container.terraform_state,
  on main.tf line 31, in resource "azurerm_storage_container" "terraform_state":
  31:   storage_account_name  = azurerm_storage_account.terraform_state_storage.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*